espressif/esp-idf/components/soc/esp32s2beta/include/soc/sensitive_reg.h
#define DPORT_PMS_DMA_RX_I_1_REG          (DR_REG_SENSITIVE_BASE + 0x0A0)
/* DPORT_PMS_DMA_RX_I_SRAM_4_H_W : R/W ;bitpos:[28] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_W  (BIT(28))
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_W_M  (BIT(28))
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_W_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_W_S  28
/* DPORT_PMS_DMA_RX_I_SRAM_4_H_R : R/W ;bitpos:[27] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_R  (BIT(27))
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_R_M  (BIT(27))
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_R_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_4_H_R_S  27
/* DPORT_PMS_DMA_RX_I_SRAM_4_L_W : R/W ;bitpos:[26] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_W  (BIT(26))
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_W_M  (BIT(26))
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_W_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_W_S  26
/* DPORT_PMS_DMA_RX_I_SRAM_4_L_R : R/W ;bitpos:[25] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_R  (BIT(25))
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_R_M  (BIT(25))
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_R_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_4_L_R_S  25
/* DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR : R/W ;bitpos:[24:8] ;default: 17'b0 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR  0x0001FFFF
#define DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR_M  ((DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR_V)<<(DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR_S))
#define DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR_V  0x1FFFF
#define DPORT_PMS_DMA_RX_I_SRAM_4_SPLTADDR_S  8
/* DPORT_PMS_DMA_RX_I_SRAM_3_W : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_3_W  (BIT(7))
#define DPORT_PMS_DMA_RX_I_SRAM_3_W_M  (BIT(7))
#define DPORT_PMS_DMA_RX_I_SRAM_3_W_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_3_W_S  7
/* DPORT_PMS_DMA_RX_I_SRAM_3_R : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_3_R  (BIT(6))
#define DPORT_PMS_DMA_RX_I_SRAM_3_R_M  (BIT(6))
#define DPORT_PMS_DMA_RX_I_SRAM_3_R_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_3_R_S  6
/* DPORT_PMS_DMA_RX_I_SRAM_2_W : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_2_W  (BIT(5))
#define DPORT_PMS_DMA_RX_I_SRAM_2_W_M  (BIT(5))
#define DPORT_PMS_DMA_RX_I_SRAM_2_W_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_2_W_S  5
/* DPORT_PMS_DMA_RX_I_SRAM_2_R : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_2_R  (BIT(4))
#define DPORT_PMS_DMA_RX_I_SRAM_2_R_M  (BIT(4))
#define DPORT_PMS_DMA_RX_I_SRAM_2_R_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_2_R_S  4
/* DPORT_PMS_DMA_RX_I_SRAM_1_W : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_1_W  (BIT(3))
#define DPORT_PMS_DMA_RX_I_SRAM_1_W_M  (BIT(3))
#define DPORT_PMS_DMA_RX_I_SRAM_1_W_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_1_W_S  3
/* DPORT_PMS_DMA_RX_I_SRAM_1_R : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_1_R  (BIT(2))
#define DPORT_PMS_DMA_RX_I_SRAM_1_R_M  (BIT(2))
#define DPORT_PMS_DMA_RX_I_SRAM_1_R_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_1_R_S  2
/* DPORT_PMS_DMA_RX_I_SRAM_0_W : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_0_W  (BIT(1))
#define DPORT_PMS_DMA_RX_I_SRAM_0_W_M  (BIT(1))
#define DPORT_PMS_DMA_RX_I_SRAM_0_W_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_0_W_S  1
/* DPORT_PMS_DMA_RX_I_SRAM_0_R : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_SRAM_0_R  (BIT(0))
#define DPORT_PMS_DMA_RX_I_SRAM_0_R_M  (BIT(0))
#define DPORT_PMS_DMA_RX_I_SRAM_0_R_V  0x1
#define DPORT_PMS_DMA_RX_I_SRAM_0_R_S  0

#define DPORT_PMS_DMA_RX_I_2_REG          (DR_REG_SENSITIVE_BASE + 0x0A4)
/* DPORT_PMS_DMA_RX_I_ILG_INTR : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_ILG_INTR  (BIT(2))
#define DPORT_PMS_DMA_RX_I_ILG_INTR_M  (BIT(2))
#define DPORT_PMS_DMA_RX_I_ILG_INTR_V  0x1
#define DPORT_PMS_DMA_RX_I_ILG_INTR_S  2
/* DPORT_PMS_DMA_RX_I_ILG_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_ILG_EN  (BIT(1))
#define DPORT_PMS_DMA_RX_I_ILG_EN_M  (BIT(1))
#define DPORT_PMS_DMA_RX_I_ILG_EN_V  0x1
#define DPORT_PMS_DMA_RX_I_ILG_EN_S  1
/* DPORT_PMS_DMA_RX_I_ILG_CLR : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_ILG_CLR  (BIT(0))
#define DPORT_PMS_DMA_RX_I_ILG_CLR_M  (BIT(0))
#define DPORT_PMS_DMA_RX_I_ILG_CLR_V  0x1
#define DPORT_PMS_DMA_RX_I_ILG_CLR_S  0

#define DPORT_PMS_DMA_RX_I_3_REG          (DR_REG_SENSITIVE_BASE + 0x0A8)
/* DPORT_PMS_DMA_RX_I_ILG_ST : RO ;bitpos:[22:0] ;default: 23'b0 ; */
/*description: */
#define DPORT_PMS_DMA_RX_I_ILG_ST  0x007FFFFF
#define DPORT_PMS_DMA_RX_I_ILG_ST_M  ((DPORT_PMS_DMA_RX_I_ILG_ST_V)<<(DPORT_PMS_DMA_RX_I_ILG_ST_S))
#define DPORT_PMS_DMA_RX_I_ILG_ST_V  0x7FFFFF
#define DPORT_PMS_DMA_RX_I_ILG_ST_S  0

#define DPORT_PMS_DMA_TX_I_0_REG          (DR_REG_SENSITIVE_BASE + 0x0AC)
/* DPORT_PMS_DMA_TX_I_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_LOCK  (BIT(0))
#define DPORT_PMS_DMA_TX_I_LOCK_M  (BIT(0))
#define DPORT_PMS_DMA_TX_I_LOCK_V  0x1
#define DPORT_PMS_DMA_TX_I_LOCK_S  0

#define DPORT_PMS_DMA_TX_I_1_REG          (DR_REG_SENSITIVE_BASE + 0x0B0)
/* DPORT_PMS_DMA_TX_I_SRAM_4_H_W : R/W ;bitpos:[28] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_W  (BIT(28))
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_W_M  (BIT(28))
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_W_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_W_S  28
/* DPORT_PMS_DMA_TX_I_SRAM_4_H_R : R/W ;bitpos:[27] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_R  (BIT(27))
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_R_M  (BIT(27))
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_R_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_4_H_R_S  27
/* DPORT_PMS_DMA_TX_I_SRAM_4_L_W : R/W ;bitpos:[26] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_W  (BIT(26))
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_W_M  (BIT(26))
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_W_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_W_S  26
/* DPORT_PMS_DMA_TX_I_SRAM_4_L_R : R/W ;bitpos:[25] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_R  (BIT(25))
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_R_M  (BIT(25))
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_R_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_4_L_R_S  25
/* DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR : R/W ;bitpos:[24:8] ;default: 17'b0 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR  0x0001FFFF
#define DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR_M  ((DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR_V)<<(DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR_S))
#define DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR_V  0x1FFFF
#define DPORT_PMS_DMA_TX_I_SRAM_4_SPLTADDR_S  8
/* DPORT_PMS_DMA_TX_I_SRAM_3_W : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_3_W  (BIT(7))
#define DPORT_PMS_DMA_TX_I_SRAM_3_W_M  (BIT(7))
#define DPORT_PMS_DMA_TX_I_SRAM_3_W_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_3_W_S  7
/* DPORT_PMS_DMA_TX_I_SRAM_3_R : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_3_R  (BIT(6))
#define DPORT_PMS_DMA_TX_I_SRAM_3_R_M  (BIT(6))
#define DPORT_PMS_DMA_TX_I_SRAM_3_R_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_3_R_S  6
/* DPORT_PMS_DMA_TX_I_SRAM_2_W : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_2_W  (BIT(5))
#define DPORT_PMS_DMA_TX_I_SRAM_2_W_M  (BIT(5))
#define DPORT_PMS_DMA_TX_I_SRAM_2_W_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_2_W_S  5
/* DPORT_PMS_DMA_TX_I_SRAM_2_R : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_2_R  (BIT(4))
#define DPORT_PMS_DMA_TX_I_SRAM_2_R_M  (BIT(4))
#define DPORT_PMS_DMA_TX_I_SRAM_2_R_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_2_R_S  4
/* DPORT_PMS_DMA_TX_I_SRAM_1_W : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_1_W  (BIT(3))
#define DPORT_PMS_DMA_TX_I_SRAM_1_W_M  (BIT(3))
#define DPORT_PMS_DMA_TX_I_SRAM_1_W_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_1_W_S  3
/* DPORT_PMS_DMA_TX_I_SRAM_1_R : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_1_R  (BIT(2))
#define DPORT_PMS_DMA_TX_I_SRAM_1_R_M  (BIT(2))
#define DPORT_PMS_DMA_TX_I_SRAM_1_R_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_1_R_S  2
/* DPORT_PMS_DMA_TX_I_SRAM_0_W : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_0_W  (BIT(1))
#define DPORT_PMS_DMA_TX_I_SRAM_0_W_M  (BIT(1))
#define DPORT_PMS_DMA_TX_I_SRAM_0_W_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_0_W_S  1
/* DPORT_PMS_DMA_TX_I_SRAM_0_R : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_SRAM_0_R  (BIT(0))
#define DPORT_PMS_DMA_TX_I_SRAM_0_R_M  (BIT(0))
#define DPORT_PMS_DMA_TX_I_SRAM_0_R_V  0x1
#define DPORT_PMS_DMA_TX_I_SRAM_0_R_S  0

#define DPORT_PMS_DMA_TX_I_2_REG          (DR_REG_SENSITIVE_BASE + 0x0B4)
/* DPORT_PMS_DMA_TX_I_ILG_INTR : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_ILG_INTR  (BIT(2))
#define DPORT_PMS_DMA_TX_I_ILG_INTR_M  (BIT(2))
#define DPORT_PMS_DMA_TX_I_ILG_INTR_V  0x1
#define DPORT_PMS_DMA_TX_I_ILG_INTR_S  2
/* DPORT_PMS_DMA_TX_I_ILG_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_ILG_EN  (BIT(1))
#define DPORT_PMS_DMA_TX_I_ILG_EN_M  (BIT(1))
#define DPORT_PMS_DMA_TX_I_ILG_EN_V  0x1
#define DPORT_PMS_DMA_TX_I_ILG_EN_S  1
/* DPORT_PMS_DMA_TX_I_ILG_CLR : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_ILG_CLR  (BIT(0))
#define DPORT_PMS_DMA_TX_I_ILG_CLR_M  (BIT(0))
#define DPORT_PMS_DMA_TX_I_ILG_CLR_V  0x1
#define DPORT_PMS_DMA_TX_I_ILG_CLR_S  0

#define DPORT_PMS_DMA_TX_I_3_REG          (DR_REG_SENSITIVE_BASE + 0x0B8)
/* DPORT_PMS_DMA_TX_I_ILG_ST : RO ;bitpos:[22:0] ;default: 23'b0 ; */
/*description: */
#define DPORT_PMS_DMA_TX_I_ILG_ST  0x007FFFFF
#define DPORT_PMS_DMA_TX_I_ILG_ST_M  ((DPORT_PMS_DMA_TX_I_ILG_ST_V)<<(DPORT_PMS_DMA_TX_I_ILG_ST_S))
#define DPORT_PMS_DMA_TX_I_ILG_ST_V  0x7FFFFF
#define DPORT_PMS_DMA_TX_I_ILG_ST_S  0

#define DPORT_PRO_BOOT_LOCATION_0_REG          (DR_REG_SENSITIVE_BASE + 0x0BC)
/* DPORT_PRO_BOOT_LOCATION_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_BOOT_LOCATION_LOCK  (BIT(0))
#define DPORT_PRO_BOOT_LOCATION_LOCK_M  (BIT(0))
#define DPORT_PRO_BOOT_LOCATION_LOCK_V  0x1
#define DPORT_PRO_BOOT_LOCATION_LOCK_S  0

#define DPORT_PRO_BOOT_LOCATION_1_REG          (DR_REG_SENSITIVE_BASE + 0x0C0)
/* DPORT_PRO_BOOT_REMAP : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_BOOT_REMAP  (BIT(0))
#define DPORT_PRO_BOOT_REMAP_M  (BIT(0))
#define DPORT_PRO_BOOT_REMAP_V  0x1
#define DPORT_PRO_BOOT_REMAP_S  0

#define DPORT_CACHE_SOURCE_0_REG          (DR_REG_SENSITIVE_BASE + 0x0C4)
/* DPORT_CACHE_SOURCE_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_CACHE_SOURCE_LOCK  (BIT(0))
#define DPORT_CACHE_SOURCE_LOCK_M  (BIT(0))
#define DPORT_CACHE_SOURCE_LOCK_V  0x1
#define DPORT_CACHE_SOURCE_LOCK_S  0

#define DPORT_CACHE_SOURCE_1_REG          (DR_REG_SENSITIVE_BASE + 0x0C8)
/* DPORT_PRO_CACHE_D_SOURCE_PRO_DROM0 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DROM0  (BIT(5))
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DROM0_M  (BIT(5))
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DROM0_V  0x1
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DROM0_S  5
/* DPORT_PRO_CACHE_D_SOURCE_PRO_DPORT : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DPORT  (BIT(4))
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DPORT_M  (BIT(4))
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DPORT_V  0x1
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DPORT_S  4
/* DPORT_PRO_CACHE_D_SOURCE_PRO_DRAM0 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DRAM0  (BIT(3))
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DRAM0_M  (BIT(3))
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DRAM0_V  0x1
#define DPORT_PRO_CACHE_D_SOURCE_PRO_DRAM0_S  3
/* DPORT_PRO_CACHE_I_SOURCE_PRO_DROM0 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_I_SOURCE_PRO_DROM0  (BIT(2))
#define DPORT_PRO_CACHE_I_SOURCE_PRO_DROM0_M  (BIT(2))
#define DPORT_PRO_CACHE_I_SOURCE_PRO_DROM0_V  0x1
#define DPORT_PRO_CACHE_I_SOURCE_PRO_DROM0_S  2
/* DPORT_PRO_CACHE_I_SOURCE_PRO_IROM0 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IROM0  (BIT(1))
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IROM0_M  (BIT(1))
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IROM0_V  0x1
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IROM0_S  1
/* DPORT_PRO_CACHE_I_SOURCE_PRO_IRAM1 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IRAM1  (BIT(0))
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IRAM1_M  (BIT(0))
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IRAM1_V  0x1
#define DPORT_PRO_CACHE_I_SOURCE_PRO_IRAM1_S  0

#define DPORT_APB_PERIPHERAL_0_REG          (DR_REG_SENSITIVE_BASE + 0x0CC)
/* DPORT_APB_PERIPHERAL_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_APB_PERIPHERAL_LOCK  (BIT(0))
#define DPORT_APB_PERIPHERAL_LOCK_M  (BIT(0))
#define DPORT_APB_PERIPHERAL_LOCK_V  0x1
#define DPORT_APB_PERIPHERAL_LOCK_S  0

